// Написати цикли, які зможуть:
//
//Вивести на сторінку в один рядок через кому числа від 10 до 20.
// for (let i = 10; i <= 20; i++) {
//     document.write(i + ',');
// }


// Вивести квадрати чисел від 10 до 20.
// for (let i = 10; i <= 20; i++) {
//     document.write(i * i + ',');
// }


// Вивести таблицю множення на 7.
// for (let i = 7; i <= 7; i = i + 1) {
//     for (let j = 1; j <= 9; j = j + 1) {
//         number = i * j
//         document.write(' ' + number + '  ')
//     }
// }


// Знайти суму всіх цілих чисел від 1 до 15.
// let sum = 0;
// for (let i = 0; i <= 15; i++) {
//     sum += i
// }
// document.write(sum);


// Знайти добуток усіх цілих чисел від 15 до 35.
// let mult = 1;
// for (let i = 15; i <= 35; i++) {
//      mult = mult * i
// }
// document.write(mult);


// Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
// let sum = 0;
// for (let i = 1; i <= 500; i++) {
//     sum += i / 500
// }
// document.write(sum);


// Вивести суму лише парних чисел в діапазоні від 30 до 80.
// let sum = 0;
// for (let i = 30; i <= 80; i++) {
//     if (i % 2 == 0){
//         sum += i
//     }
// }
// document.write(sum)



// // Вивести всі числа в діапазоні від 100 до 200 кратні 3.
// for (let i = 100; i <= 200; i++) {
//     if (i % 3 == 0){
//         document.write(i + ',');
//     }
// }


// Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
// let num = +prompt('Введіть натуральне число');
//
// for (let i = 2; i * 2 <= num; i++) {
//     if (num % i == 0) {
//         document.write(i + ',')
//     }
// }

// Визначити кількість його парних дільників.
//
// let num = +prompt('Введіть натуральне число');
//
// for (let i = 2; i * 2 <= num; i++) {
//     if (num % i == 0) {
//         num = i;
//         document.write(num);
//     }
// }


// Знайти суму його парних дільників.

// let num = +prompt('Введіть натуральне число');
//
// for (let i = 2; i * 2 <= num; i++) {
//     if (num % i == 0) {
//         num = i;
//         document.write(num + num);
//     }
// }




//     Надрукувати повну таблицю множення від 1 до 10.
// for (let i = 1; i <= 9; i = i + 1) {
//     for (let j = 1; j <= 9; j = j + 1) {
//         number = i * j;
//         document.write(' ' + number + '  ');
//     }
//     document.write('<br>')
// }





