// 23
// Частина №1
// Створити скрипт яки повинен виконувати наступне:
// запитати у користувача рік народження;
// запитати в нього, в якому місті він живе;
// запитати його улюблений вид спорту.
//
//     При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:
//     його вік;
// якщо користувач вкаже Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..."
// і на місце точок підставляємо країну, столицею якої є місто. Інакше показуємо йому “ти живеш у місті…”, де місце точок – введене місто.
//
//     Частина №2
// Вибираємо самі три види спорту та три чемпіони у цих видах.
// Відповідно, якщо користувач вкаже один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати …?
// і підставляємо на місце точок ім'я та прізвище чемпіона.
// Все це має бути відображено в одному вікні (алерті).
//     Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення –
//     “Шкода, що Ви не захотіли ввести свій(ю) …” і вказуємо, що він не захотів вводити – дату народження, місто чи вид спорту .
//
//
//

const userBirthYear = prompt('Привiт! В якому роцi ти народився?');
const userTown = prompt('У якому мiстi живешь?');
const userSport = prompt('Який у тебе улюблений вид спорту?');

const getAge = (data) => {
    if (data === null){
        return 'Шкода, що Ви не захотіли ввести свою дату народження'
    }else{
        return new Date().getFullYear() - data;
    }
};

const requestOfTown = (town) => {
    if (town === 'Київ'){
        return 'Ти живеш у столиці України'
    }else if (town === 'Вашингтон'){
        return 'Ти живеш у столиці США'
    }else if (town === 'Лондон'){
        return 'Ти живеш у столиці Великої Британії'
    }else if (town === null) {
       return 'Шкода, що Ви не захотіли ввести своє місто'
    }else{
        return `Ти живеш у місті ${town}`
    }
};


const requestOfSport = (sport) => {
    if (sport === 'футбол'){
        return 'Круто! Хочеш стати Кріштіану Рональду?'
    }else if (sport === 'баскетбол') {
        return 'Круто! Хочеш стати Майклом Джорданом?'
    }else if (sport === 'біг'){
        return 'Круто! Хочеш стати Еліудом Кіпчоге?'
    }else if (sport === null){
        return 'Шкода, що Ви не захотіли ввести свій улюблений вид спорту'
    }
};


alert(`Твій вiк ${getAge(userBirthYear)}
${requestOfTown(userTown)}
${requestOfSport(userSport)}`);
