

// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

// for (let i = 20; i <= 30; i = i + 0.5) {
//     document.write(i + ', ')
// }



// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

// for (let i = 10; i <= 100; i = i + 10) {
//     document.write(i * 27 + ', ')
// }


// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

// let num = prompt('Введіть ціле число', '')
//
// for (let i = 1; i <= 100; i++) {
//     if (i <= Math.sqrt(num)) {
//         document.write(i, ', ')
//     }
// }




// Дане ціле число. З'ясувати, чи є воно простим
// (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

// function isPrime (num) {
//     for (let i = 2; i < num; i++){
//         if (num % i === 0) {
//             return false;
//         }
//     }
//     return num > 1
// }
// console.log(isPrime(10))




// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь.
// (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

// let num = prompt('Введіть ціле число', '')
//
// while (num % 3 == 0) {
//     num /= 3;
// }
// alert((num == 1)? "Число можнa отримати" : "Число не можна отримати")


